<?
/***********************************************************************
*
*  ÀÛÀº´Þ:1, Å«´Þ:2, Æò´Þ(¼Ò)+À±´Þ(¼Ò):3, Æò´Þ(¼Ò)+À±´Þ(´ë):4,
*  Æò´Þ(´ë)+À±´Þ(¼Ò):5, Æò´Þ(´ë)+À±´Þ(´ë):6
*
*  È£Ãâ¹ý: soltolun(2002,01,11) ¶Ç´Â luntosol(2001,02,15,true)
*  µ¥¸ð : http://www.mytechnic.com/tips/calenda_lun_view.php
************************************************************************/
$startyear    = 1841;
$endyear    = 2043;

$hganarray    = array("Ë£","ëà","Ü°","ïË","Ùæ","Ðù","ÌÒ","ãô","ìó","Í¤");
$hjiarray    = array("í­","õä","ìÙ","ÙÖ","òã","ÞÓ","çí","Ú±","ãé","ë·","âù","ú¤");
$kganarray    = array("°©","À»","º´","Á¤","¹«","±â","°æ","½Å","ÀÓ","°è");
$kjiarray    = array("ÀÚ","Ãà","ÀÎ","¹¦","Áø","»ç","¿À","¹Ì","½Å","À¯","¼ú","ÇØ");
$kddiarray    = array("Áã","¼Ò","È£¶ûÀÌ","Åä³¢","¿ë","¹ì","¸»","¾ç","¿ø¼þÀÌ","´ß","°³","µÅÁö");
$kweekarray    = array("ÀÏ","¿ù","È­","¼ö","¸ñ","±Ý","ÀÏ");
$moflastday    = array(31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31);
$yeararray    = array(12, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11);
$dbarray    = array (
//1841³â ~ 1900³â
1,2,4,1,1,2,1,2,1,2,2,1,    2,2,1,2,1,1,2,1,2,1,2,1,    2,2,2,1,2,1,4,1,2,1,2,1,    2,2,1,2,1,2,1,2,1,2,1,2,    1,2,1,2,2,1,2,1,2,1,2,1,
2,1,2,1,5,2,1,2,2,1,2,1,    2,1,1,2,1,2,1,2,2,2,1,2,    1,2,1,1,2,1,2,1,2,2,2,1,    2,1,2,3,2,1,2,1,2,1,2,2,    2,1,2,1,1,2,1,1,2,2,1,2,
2,2,1,2,1,1,2,1,2,1,5,2,    2,1,2,2,1,1,2,1,2,1,1,2,    2,1,2,2,1,2,1,2,1,2,1,2,    1,2,1,2,1,2,5,2,1,2,1,2,    1,1,2,1,2,2,1,2,2,1,2,1,
2,1,1,2,1,2,1,2,2,2,1,2,    1,2,1,1,5,2,1,2,1,2,2,2,    1,2,1,1,2,1,1,2,2,1,2,2,    2,1,2,1,1,2,1,1,2,1,2,2,    2,1,6,1,1,2,1,1,2,1,2,2,
1,2,2,1,2,1,2,1,2,1,1,2,    2,1,2,1,2,2,1,2,2,3,1,2,    1,2,2,1,2,1,2,2,1,2,1,2,    1,1,2,1,2,1,2,2,1,2,2,1,    2,1,1,2,4,1,2,2,1,2,2,1,
2,1,1,2,1,1,2,2,1,2,2,2,    1,2,1,1,2,1,1,2,1,2,2,2,    1,2,2,3,2,1,1,2,1,2,2,1,    2,2,2,1,1,2,1,1,2,1,2,1,    2,2,2,1,2,1,2,1,1,5,2,1,
2,2,1,2,2,1,2,1,2,1,1,2,    1,2,1,2,2,1,2,1,2,2,1,2,    1,1,2,1,2,4,2,1,2,2,1,2,    1,1,2,1,2,1,2,1,2,2,2,1,    2,1,1,2,1,1,2,1,2,2,2,1,
2,2,1,1,5,1,2,1,2,2,1,2,    2,2,1,1,2,1,1,2,1,2,1,2,    2,2,1,2,1,2,1,1,2,1,2,1,    2,2,4,2,1,2,1,1,2,1,2,1,    2,1,2,2,1,2,2,1,2,1,1,2,
1,2,1,2,1,2,5,2,2,1,2,1,    1,2,1,2,1,2,1,2,2,1,2,2,    1,1,2,1,1,2,1,2,2,2,1,2,    2,1,1,2,3,2,1,2,2,1,2,2,    2,1,1,2,1,1,2,1,2,1,2,2,
2,1,2,1,2,1,1,2,1,2,1,2,    2,2,1,5,2,1,1,2,1,2,1,2,    2,1,2,2,1,2,1,1,2,1,2,1,    2,1,2,2,1,2,1,2,1,2,1,2,    1,5,2,1,2,2,1,2,1,2,1,2,
1,2,1,2,1,2,1,2,2,1,2,2,    1,1,2,1,1,5,2,2,1,2,2,2,    1,1,2,1,1,2,1,2,1,2,2,2,    1,2,1,2,1,1,2,1,2,1,2,2,    2,1,2,1,5,1,2,1,2,1,2,1,
2,2,2,1,2,1,1,2,1,2,1,2,    1,2,2,1,2,1,2,1,2,1,2,1,    2,1,5,2,2,1,2,1,2,1,2,1,    2,1,2,1,2,1,2,2,1,2,1,2,    1,2,1,1,2,1,2,5,2,2,1,2,

//1901³â ~ 2000³â
1,2,1,1,2,1,2,1,2,2,2,1,    2,1,2,1,1,2,1,2,1,2,2,2,    1,2,1,2,3,2,1,1,2,2,1,2,    2,2,1,2,1,1,2,1,1,2,2,1,    2,2,1,2,2,1,1,2,1,2,1,2,
1,2,2,4,1,2,1,2,1,2,1,2,    1,2,1,2,1,2,2,1,2,1,2,1,    2,1,1,2,2,1,2,1,2,2,1,2,    1,5,1,2,1,2,1,2,2,2,1,2,    1,2,1,1,2,1,2,1,2,2,2,1,
2,1,2,1,1,5,1,2,2,1,2,2,    2,1,2,1,1,2,1,1,2,2,1,2,    2,2,1,2,1,1,2,1,1,2,1,2,    2,2,1,2,5,1,2,1,2,1,1,2,    2,1,2,2,1,2,1,2,1,2,1,2,
1,2,1,2,1,2,2,1,2,1,2,1,    2,3,2,1,2,2,1,2,2,1,2,1,    2,1,1,2,1,2,1,2,2,2,1,2,    1,2,1,1,2,1,5,2,2,1,2,2,    1,2,1,1,2,1,1,2,2,1,2,2,
2,1,2,1,1,2,1,1,2,1,2,2,    2,1,2,2,3,2,1,1,2,1,2,2,    1,2,2,1,2,1,2,1,2,1,1,2,    2,1,2,1,2,2,1,2,1,2,1,1,    2,1,2,5,2,1,2,2,1,2,1,2,
1,1,2,1,2,1,2,2,1,2,2,1,    2,1,1,2,1,2,1,2,2,1,2,2,    1,5,1,2,1,1,2,2,1,2,2,2,    1,2,1,1,2,1,1,2,1,2,2,2,    1,2,2,1,1,5,1,2,1,2,2,1,
2,2,2,1,1,2,1,1,2,1,2,1,    2,2,2,1,2,1,2,1,1,2,1,2,    1,2,2,1,6,1,2,1,2,1,1,2,    1,2,1,2,2,1,2,2,1,2,1,2,    1,1,2,1,2,1,2,2,1,2,2,1,
2,1,4,1,2,1,2,1,2,2,2,1,    2,1,1,2,1,1,2,1,2,2,2,1,    2,2,1,1,2,1,4,1,2,2,1,2,    2,2,1,1,2,1,1,2,1,2,1,2,    2,2,1,2,1,2,1,1,2,1,2,1,
2,2,1,2,2,4,1,1,2,1,2,1,    2,1,2,2,1,2,2,1,2,1,1,2,    1,2,1,2,1,2,2,1,2,2,1,2,    1,1,2,4,1,2,1,2,2,1,2,2,    1,1,2,1,1,2,1,2,2,2,1,2,
2,1,1,2,1,1,2,1,2,2,1,2,    2,5,1,2,1,1,2,1,2,1,2,2,    2,1,2,1,2,1,1,2,1,2,1,2,    2,2,1,2,1,2,3,2,1,2,1,2,    2,1,2,2,1,2,1,1,2,1,2,1,
2,1,2,2,1,2,1,2,1,2,1,2,    1,2,1,2,4,2,1,2,1,2,1,2,    1,2,1,1,2,2,1,2,2,1,2,2,    1,1,2,1,1,2,1,2,2,1,2,2,    2,1,4,1,1,2,1,2,1,2,2,2,
1,2,1,2,1,1,2,1,2,1,2,2,    2,1,2,1,2,1,1,5,2,1,2,2,    1,2,2,1,2,1,1,2,1,2,1,2,    1,2,2,1,2,1,2,1,2,1,2,1,    2,1,2,1,2,5,2,1,2,1,2,1,
2,1,2,1,2,1,2,2,1,2,1,2,    1,2,1,1,2,1,2,2,1,2,2,1,    2,1,2,3,2,1,2,1,2,2,2,1,    2,1,2,1,1,2,1,2,1,2,2,2,    1,2,1,2,1,1,2,1,1,2,2,1,
2,2,5,2,1,1,2,1,1,2,2,1,    2,2,1,2,2,1,1,2,1,2,1,2,    1,2,2,1,2,1,5,2,1,2,1,2,    1,2,1,2,1,2,2,1,2,1,2,1,    2,1,1,2,2,1,2,1,2,2,1,2,
1,2,1,1,5,2,1,2,2,2,1,2,    1,2,1,1,2,1,2,1,2,2,2,1,    2,1,2,1,1,2,1,1,2,2,2,1,    2,2,1,5,1,2,1,1,2,2,1,2,    2,2,1,2,1,1,2,1,1,2,1,2,
2,2,1,2,1,2,1,5,2,1,1,2,    2,1,2,2,1,2,1,2,1,2,1,1,    2,2,1,2,1,2,2,1,2,1,2,1,    2,1,1,2,1,6,1,2,2,1,2,1,    2,1,1,2,1,2,1,2,2,1,2,2,
1,2,1,1,2,1,1,2,2,1,2,2,    2,1,2,3,2,1,1,2,2,1,2,2,    2,1,2,1,1,2,1,1,2,1,2,2,    2,1,2,2,1,1,2,1,1,5,2,2,    1,2,2,1,2,1,2,1,1,2,1,2,
1,2,2,1,2,2,1,2,1,2,1,1,    2,1,2,2,1,5,2,2,1,2,1,2,    1,1,2,1,2,1,2,2,1,2,2,1,    2,1,1,2,1,2,1,2,2,1,2,2,    1,2,1,1,5,1,2,1,2,2,2,2,
1,2,1,1,2,1,1,2,1,2,2,2,    1,2,2,1,1,2,1,1,2,1,2,2,    1,2,5,2,1,2,1,1,2,1,2,1,    2,2,2,1,2,1,2,1,1,2,1,2,    1,2,2,1,2,2,1,5,2,1,1,2,
1,2,1,2,2,1,2,1,2,2,1,2,    1,1,2,1,2,1,2,2,1,2,2,1,    2,1,1,2,3,2,2,1,2,2,2,1,    2,1,1,2,1,1,2,1,2,2,2,1,    2,2,1,1,2,1,1,2,1,2,2,1,

//2001³â ~ 2043³â
2,2,2,3,2,1,1,2,1,2,1,2,    2,2,1,2,1,2,1,1,2,1,2,1,    2,2,1,2,2,1,2,1,1,2,1,2,    1,5,2,2,1,2,1,2,2,1,1,2,    1,2,1,2,1,2,2,1,2,2,1,1,
1,1,2,1,2,1,5,2,2,1,2,2,    1,1,2,1,1,2,1,2,2,2,1,2,    2,1,1,2,1,1,2,1,2,2,1,2,    2,2,1,1,5,1,2,1,2,1,2,2,    2,1,2,1,2,1,1,2,1,2,1,2,
2,1,2,2,1,2,1,1,2,1,2,1,    2,1,6,2,1,2,1,1,2,1,2,1,    2,1,2,2,1,2,1,2,1,2,1,2,    1,2,1,2,1,2,1,2,5,2,1,2,    1,2,1,1,2,1,2,2,2,1,2,2,
1,1,2,1,1,2,1,2,2,1,2,2,    2,1,1,2,3,2,1,2,1,2,2,2,    1,2,1,2,1,1,2,1,2,1,2,2,    2,1,2,1,2,1,1,2,1,2,1,2,    2,1,2,5,2,1,1,2,1,2,1,2,
1,2,2,1,2,1,2,1,2,1,2,1,    2,1,2,1,2,2,1,2,1,2,1,2,    1,5,2,1,2,1,2,2,1,2,1,2,    1,2,1,1,2,1,2,2,1,2,2,1,    2,1,2,1,1,5,2,1,2,2,2,1,
2,1,2,1,1,2,1,2,1,2,2,2,    1,2,1,2,1,1,2,1,1,2,2,2,    1,2,2,1,5,1,2,1,1,2,2,1,    2,2,1,2,2,1,1,2,1,1,2,2,    1,2,1,2,2,1,2,1,2,1,2,1,
2,1,5,2,1,2,2,1,2,1,2,1,    2,1,1,2,1,2,2,1,2,2,1,2,    1,2,1,1,2,1,5,2,2,2,1,2,    1,2,1,1,2,1,2,1,2,2,2,1,    2,1,2,1,1,2,1,1,2,2,1,2,
2,2,1,2,1,4,1,1,2,1,2,2,    2,2,1,2,1,1,2,1,1,2,1,2,    2,2,1,2,1,2,1,2,1,1,2,1,    2,2,1,2,5,2,1,2,1,2,1,1,    2,1,2,2,1,2,2,1,2,1,2,1,
2,1,1,2,1,2,2,1,2,2,1,2,    1,5,1,2,1,2,1,2,2,2,1,2,    1,2,1,1,2,1,1,2,2,1,2,2);

function febdays($smonth) {
    if(($smonth%100 != 0 && $smonth%4 ==0) || $smonth%400 ==0) $moflastday[1] = 29;
    else $moflastday[1] = 28;
    return $moflastday[1];
}

function alltoday($syear) {
    global $moflastday;
    global $startyear;
    $totalday -= 22;
    for($step=$startyear;$step<=$syear-1;$step++) {
        $moflastday[1] = febdays($step);
        $totalmonthday = array_sum($moflastday);
        $totalday += $totalmonthday;
    }
    return $totalday;
}

function numformat($integer) {
    return sprintf("%02d", $integer);
}

function soltolun($syear, $smonth, $sday) {

    global $startyear,$endyear,$hganarray,$hjiarray,$kganarray,$kjiarray;
    global $kddiarray,$kweekarray,$moflastday,$yeararray,$dbarray;

    if($syear < 1842 || $syear > 2040) return false;

    $totaldate = $syear.numformat($smonth).numformat($sday);
    if($totaldate > 20440130 || $totaldate < 18410123) return false;


    $totalday = alltoday($syear);
    $moflastday[1] = febdays($syear);

    for($tempmonth=0;$tempmonth<$smonth-1;$tempmonth++) $totalday += $moflastday[$tempmonth];
    $totalday += $sday;

    $dbindex = 0;
    $temptotalday = $totalday;

    while(1) {
        if($dbarray[$dbindex] == 1) {
            $moflastdaylun = 29;
            $leap = false;
        }
        else if($dbarray[$dbindex] == 2) {
            $moflastdaylun = 30;
            $leap = false;
        }
        else if($dbarray[$dbindex] == 3) {
            $moflastdaylun = 29;
            $moflastdayleap = 29;
            $leap = true;
            if($temptotalday > 29) $temptotalday -= 29;
        }
        else if($dbarray[$dbindex] == 4) {
            $moflastdaylun = 29;
            $moflastdayleap = 30;
            $leap = true;
            if($temptotalday > 30) $temptotalday -= 30;
        }
        else if($dbarray[$dbindex] == 5) {
            $moflastdaylun = 30;
            $moflastdayleap = 29;
            $leap = true;
            if($temptotalday > 29) $temptotalday -= 29;
        }
        else if($dbarray[$dbindex] == 6) {
            $moflastdaylun = 30;
            $moflastdayleap = 30;
            $leap = true;
            if($temptotalday > 30) $temptotalday -= 30;
        }
        $temptotalday -= $moflastdaylun;
        $dbindex++;
        $lyear = floor($dbindex/12);
        if($temptotalday <= 0) break;
    }
    if($leap) $temptotalday += $moflastdayleap;
    else $temptotalday +=$moflastdaylun;

    $lyear    += $startyear;
    $lmonth = $yeararray[$dbindex%12];
    $lday = $temptotalday;
    $a = ($lyear + 6) % 10;
    $b = ($lyear + 8) % 12;
    $c = ($totalday + 2) % 10;
    $d = ($totalday + 10) % 12;
    $e = ($totalday + 5) % 7;

    /* output */
    $myarray["year"]    = $lyear;
    $myarray["month"]    = $lmonth;
    $myarray["day"]        = $lday;
    $myarray["yhgan"]    = $hganarray[$a];
    $myarray["ykgan"]    = $kganarray[$a];
    $myarray["yhji"]    = $hjiarray[$b];
    $myarray["ykji"]    = $kjiarray[$b];
    $myarray["kddi"]    = $kddiarray[$b];
    $myarray["dhgan"]    = $hganarray[$c];
    $myarray["dkgan"]    = $kganarray[$c];
    $myarray["dhji"]    = $hjiarray[$d];
    $myarray["dkji"]    = $kjiarray[$d];
    $myarray["week"]    = $kweekarray[$e];
    $myarray["leap"]    = $leap;
    return $myarray;
}



function luntosol($lyear, $lmonth, $lday, $leap='') {

    global $startyear,$endyear,$hganarray,$hjiarray,$kganarray,$kjiarray;
    global $kddiarray,$kweekarray,$moflastday,$yeararray,$dbarray;

    if($lyear < 1842 || $lyear > 2040) return false;

    if($lyear > $endyear || $lyear < $startyear) return false;

    $temptotalday = 0;
    $dbindex = ($lyear - $startyear) * 12 + ($lmonth - 1) - 1;
    for($step=$dbindex;$step>=0;$step--) {
        if($dbarray[$step] == 1) $temptotalday += 29;
        else if($dbarray[$step] == 2) $temptotalday += 30;
        else if($dbarray[$step] == 3) $temptotalday += 58;
        else if($dbarray[$step] == 4) $temptotalday += 59;
        else if($dbarray[$step] == 5) $temptotalday += 59;
        else if($dbarray[$step] == 6) $temptotalday += 60;
    }


    $dbindex = ($lyear - $startyear) * 12 + ($lmonth) -1;
    if($leap) {
        if($dbarray[$dbindex] == 3 || $dbarray[$dbindex] == 4) $temptotalday += 29;
        else if($dbarray[$dbindex] == 5 || $dbarray[$dbindex] == 6) $temptotalday += 30;
    }

    $temptotalday += $lday + 22;
    $totalday = $temptotalday;
    $tempyear = $startyear;

    while(1) {
        $moflastday[1] = febdays($tempyear);
        for($tempmonth=0;$tempmonth<12;$tempmonth++) {
            $temptotalday -= $moflastday[$tempmonth];
            if($temptotalday <= 0) {
                $temptotalday += $moflastday[$tempmonth];
                $tempday = $temptotalday;
                break 2;
            }
        }
        $tempyear++;
    }

    $syear = $tempyear;
    $smonth = $tempmonth + 1;
    $sday = $tempday;
    $a = ($lyear+6) % 10;
    $b = ($lyear+8) % 12;
    $c = $totalday % 10;
    $d = $totalday % 12;
    $e = ($totalday+4) % 7;

    /* output */
    $myarray["year"]    = $syear;
    $myarray["month"]   = $smonth;
    $myarray["day"]     = $sday;
    $myarray["yhgan"]    = $hganarray[$a];
    $myarray["ykgan"]    = $kganarray[$a];
    $myarray["yhji"]    = $hjiarray[$b];
    $myarray["ykji"]    = $kjiarray[$b];
    $myarray["kddi"]    = $kddiarray[$b];
    $myarray["dhgan"]    = $hganarray[$c];
    $myarray["dkgan"]    = $kganarray[$c];
    $myarray["dhji"]    = $hjiarray[$d];
    $myarray["dkji"]    = $kjiarray[$d];
    $myarray["week"]    = $kweekarray[$e];
    $myarray["leap"]    = $leap;
    return $myarray;
}
?>